<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"bc084394eae01802e8ab04aa4926ff947f0c0b6d4e071228b02767bea595e7ce","plan_job_ref":"Job .github/workflows/_test-tf.yaml #227 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11948437397","plan_out_hash":"a5ae2a59c6607238c3b57bb8f975c12f5a09220932b2499da7877ba8651d164e","plan_hash":"2fbf4922b1480caeda96a9bf42acb6f95ddfd37debda2102783afcf001e17e50","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #227](https://github.com/tx-pts-dai/github-workflows/actions/runs/11948437397)